app/views/teams/index.html.erb

        <td><%= team.wins %>-<%= team.losses %></td>
        <td>(<%= Division.where(:data_name => team.division).first.name %>)</td>
---
SELECT  "divisions".* FROM "divisions" WHERE "divisions"."data_name" = ?  ORDER BY "divisions"."id" ASC LIMIT 1  [["data_name", "nfc-east"]]