app/views/users/show.html.erb

  <tbody>
    <% @user.picks.each do |pick| %>
      <tr>
        <% @game = Game.find(pick.game_id) %>
        <% @ht = Team.where(:team_id => @game.ht_id).first %>
---
SELECT "picks".* FROM "picks" WHERE "picks"."user_id" = ?  [["user_id", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 177]]
SELECT  "teams".* FROM "teams" WHERE "teams"."team_id" = ?  ORDER BY "teams"."id" ASC LIMIT 1  [["team_id", "ne"]]