app/views/games/show.html.erb

SELECT  "picks".* FROM "picks" WHERE "picks"."user_id" = ? AND "picks"."game_id" = ?  ORDER BY "picks"."id" ASC LIMIT 1  [["user_id", 3], ["game_id", 337]]
---
<% if logged_in? %>
  <% @pick = Pick.where(:user_id => current_user.id, :game_id => @game.id).first %>