app/controllers/picks_controller.rb

  def index
    @picks = Pick.all
---
SELECT "picks".* FROM "picks"

  def new
    @pick = Pick.new
    @game = Game.find(params[:id])
    @home = Team.where(:team_id => @game.ht_id).first
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 177]]
SELECT  "teams".* FROM "teams" WHERE "teams"."team_id" = ?  ORDER BY "teams"."id" ASC LIMIT 1  [["team_id", "ne"]]

  def edit
    @pick = Pick.find(params[:id])
    @game = @pick.game
    @home = Team.where(:team_id => @game.ht_id).first
---
SELECT  "picks".* FROM "picks" WHERE "picks"."id" = ? LIMIT 1  [["id", 181]]
SELECT  "teams".* FROM "teams" WHERE "teams"."team_id" = ?  ORDER BY "teams"."id" ASC LIMIT 1  [["team_id", "buf"]]

  def create
    @pick = Pick.new(pick_params)
    @pick.result = 0
    @pick.user_id = current_user.id
    @pick.game_id = Game.find(params[:game_id]).id
    @pick.week = Game.find(params[:game_id]).week

    respond_to do |format|
      if @pick.save
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "picks" ("pick", "result", "user_id", "game_id", "week", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["pick", 2], ["result", 0], ["user_id", 3], ["game_id", 178], ["week", 1], ["created_at", "2015-12-09 04:36:38.309659"], ["updated_at", "2015-12-09 04:36:38.309659"]]
UPDATE "picks" SET "result" = ?, "updated_at" = ? WHERE "picks"."id" = ?  [["result", 2], ["updated_at", "2015-12-09 09:28:22.201860"], ["id", 9]]

  def update
    respond_to do |format|
      if @pick.update(pick_params)
---
UPDATE "picks" SET "result" = ?, "updated_at" = ? WHERE "picks"."id" = ?  [["result", 1], ["updated_at", "2015-12-09 09:06:17.032976"], ["id", 8]]

    def set_pick
      @pick = Pick.find(params[:id])
---
SELECT  "picks".* FROM "picks" WHERE "picks"."id" = ? LIMIT 1  [["id", 5]]